import math


def area(r):
    """
    Считает площадь круга по радиусу r.
    Формула: S = πR²

    Аргументы:
        r (float): радиус круга

    Возвращаемое значение:
        (float): прощадь круга

    Пример вызова:
        >>> area(2)
        12.566370614359172
    """
    return math.pi * r * r


def perimeter(r):
    """
    Считает длину окружности (периметр круга) по радиусу r.
    Формула: P = 2πR

    Аргументы:
        r (float): радиус круга

    Возвращаемое значение:
        (float): периметр круга

    Пример вызова:
        >>> perimeter(2)
        12.566370614359172
    """
    return 2 * math.pi * r
