def area(a: float) -> float:
    """
    Считает площадь квадрата по длине стороны a.
    Формула: S = a²

    Аргументы:
        a (float): длина стороны

    Возвращаемое значение:
        (float): прощадь квадрата

    Пример вызова:
        >>> area(5)
        25
    """
    return a * a


def perimeter(a: float) -> float:
    """
    Считает периметр квадрата по длине стороны a.
    Формула: P = 4a

    Аргументы:
        a (float): длина стороны

    Возвращаемое значение:
        (float): периметр квадрата

    Пример вызова:
        >>> perimeter(5)
        20
    """
    return 4 * a
