def perimeter(a: float, b: float, c: float) -> float:
    """
    Считает периметр треугольника по всем его сторонам.
    Формула: P = a + b + c

    Аргументы:
        a (float): первая сторона треугольника
        b (float): вторая сторона треугольника
        c (float): третья сторона треугольника

    Возвращаемое значение:
        (float): периметр треугольника

    Пример вызова:
        >>> perimeter(1, 1, 1)
        3
    """
    return a + b + c


def area(a: float, h: float) -> float:
    """
    Считает площадь треугольника по стороне и высоте, опущенной на эту сторону.
    Формула: S = (a * h) / 2

    Аргументы:
        a (float): сторона треугольника
        h (float): высота, опущенная на a

    Возвращаемое значение:
        (float): прощадь треугольника

    Пример вызова:
        >>> area(1, 2)
        2
    """
    return (a * h) / 2
